program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.3"}, {"coremlc-version", "1436.100.10"}, {"coremltools-component-tensorflow", "2.6.0"}, {"coremltools-version", "5.2.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 4096, 131]> input_melspec) {
            tensor<int32, [3]> model_time_distributed_Reshape_shape = const()[name = tensor<string, []>("model_time_distributed_Reshape_shape"), val = tensor<int32, [3]>([-1, 8, 32])];
            tensor<int32, [2]> model_time_distributed_flatten_Const = const()[name = tensor<string, []>("model_time_distributed_flatten_Const"), val = tensor<int32, [2]>([-1, 256])];
            tensor<int32, []> model_beats_downbeats_concat_dense_concat_axis = const()[name = tensor<string, []>("model_beats_downbeats_concat_dense_concat_axis"), val = tensor<int32, []>(2)];
            tensor<int32, [4]> model_reshape_Reshape_shape = const()[name = tensor<string, []>("model_reshape_Reshape_shape"), val = tensor<int32, [4]>([1, -1, 131, 1])];
            tensor<string, []> input_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("input_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 4096, 131]> cast_546 = cast(dtype = input_1_to_fp16_dtype_0, x = input_melspec);
            tensor<fp16, [1, 4096, 131, 1]> model_reshape_Reshape_cast = reshape(shape = model_reshape_Reshape_shape, x = cast_546);
            tensor<int32, [4]> transpose_1_perm_0 = const()[name = tensor<string, []>("transpose_1_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> model_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 1, 1, 1]> transpose_0_to_fp16 = const()[name = tensor<string, []>("transpose_0_to_fp16"), val = tensor<fp16, [32, 1, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [32]> const_37_to_fp16 = const()[name = tensor<string, []>("const_37_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192)))];
            tensor<fp16, [1, 1, 4096, 131]> transpose_234 = transpose(perm = transpose_1_perm_0, x = model_reshape_Reshape_cast);
            tensor<fp16, [1, 32, 4096, 131]> model_conv2d_BiasAdd_cast = conv(bias = const_37_to_fp16, dilations = model_conv2d_Conv2Dx_dilations_0, groups = model_conv2d_Conv2Dx_groups_0, pad = model_conv2d_Conv2Dx_pad_0, pad_type = model_conv2d_Conv2Dx_pad_type_0, strides = model_conv2d_Conv2Dx_strides_0, weight = transpose_0_to_fp16, x = transpose_234);
            tensor<fp16, []> elu_0_alpha_0_to_fp16 = const()[name = tensor<string, []>("elu_0_alpha_0_to_fp16"), val = tensor<fp16, []>(0x1.ac4p+0)];
            tensor<fp16, [1, 32, 4096, 131]> elu_0_cast = elu(alpha = elu_0_alpha_0_to_fp16, x = model_conv2d_BiasAdd_cast);
            tensor<fp16, []> model_conv2d_Selu_y_0_to_fp16 = const()[name = tensor<string, []>("model_conv2d_Selu_y_0_to_fp16"), val = tensor<fp16, []>(0x1.0dp+0)];
            tensor<fp16, [1, 32, 4096, 131]> model_conv2d_Selu_cast = mul(x = elu_0_cast, y = model_conv2d_Selu_y_0_to_fp16);
            tensor<string, []> model_conv2d_1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_1_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_1_Conv2Dx_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [4]> model_conv2d_1_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_1_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 1, 7, 7]> transpose_2_to_fp16 = const()[name = tensor<string, []>("transpose_2_to_fp16"), val = tensor<fp16, [32, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(320)))];
            tensor<fp16, [32]> const_38_to_fp16 = const()[name = tensor<string, []>("const_38_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3520)))];
            tensor<fp16, [1, 32, 4096, 131]> model_conv2d_1_BiasAdd_cast = conv(bias = const_38_to_fp16, dilations = model_conv2d_1_Conv2Dx_dilations_0, groups = model_conv2d_1_Conv2Dx_groups_0, pad = model_conv2d_1_Conv2Dx_pad_0, pad_type = model_conv2d_1_Conv2Dx_pad_type_0, strides = model_conv2d_1_Conv2Dx_strides_0, weight = transpose_2_to_fp16, x = model_conv2d_Selu_cast);
            tensor<string, []> model_conv2d_2_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_2_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_2_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_2_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_2_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_2_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_2_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_2_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_2_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_2_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 32, 1, 1]> transpose_4_to_fp16 = const()[name = tensor<string, []>("transpose_4_to_fp16"), val = tensor<fp16, [64, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3648)))];
            tensor<fp16, [64]> const_39_to_fp16 = const()[name = tensor<string, []>("const_39_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7808)))];
            tensor<fp16, [1, 64, 4096, 131]> model_conv2d_2_BiasAdd_cast = conv(bias = const_39_to_fp16, dilations = model_conv2d_2_Conv2Dx_dilations_0, groups = model_conv2d_2_Conv2Dx_groups_0, pad = model_conv2d_2_Conv2Dx_pad_0, pad_type = model_conv2d_2_Conv2Dx_pad_type_0, strides = model_conv2d_2_Conv2Dx_strides_0, weight = transpose_4_to_fp16, x = model_conv2d_1_BiasAdd_cast);
            tensor<fp16, []> elu_1_alpha_0_to_fp16 = const()[name = tensor<string, []>("elu_1_alpha_0_to_fp16"), val = tensor<fp16, []>(0x1.ac4p+0)];
            tensor<fp16, [1, 64, 4096, 131]> elu_1_cast = elu(alpha = elu_1_alpha_0_to_fp16, x = model_conv2d_2_BiasAdd_cast);
            tensor<fp16, []> model_activation_Selu_y_0_to_fp16 = const()[name = tensor<string, []>("model_activation_Selu_y_0_to_fp16"), val = tensor<fp16, []>(0x1.0dp+0)];
            tensor<fp16, [1, 64, 4096, 131]> model_activation_Selu_cast = mul(x = elu_1_cast, y = model_activation_Selu_y_0_to_fp16);
            tensor<string, []> model_conv2d_3_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_3_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_3_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_3_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_3_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_3_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_3_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_3_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_3_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_3_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 64, 1, 1]> transpose_6_to_fp16 = const()[name = tensor<string, []>("transpose_6_to_fp16"), val = tensor<fp16, [32, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8000)))];
            tensor<fp16, [32]> const_40_to_fp16 = const()[name = tensor<string, []>("const_40_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12160)))];
            tensor<fp16, [1, 32, 4096, 131]> model_conv2d_3_BiasAdd_cast = conv(bias = const_40_to_fp16, dilations = model_conv2d_3_Conv2Dx_dilations_0, groups = model_conv2d_3_Conv2Dx_groups_0, pad = model_conv2d_3_Conv2Dx_pad_0, pad_type = model_conv2d_3_Conv2Dx_pad_type_0, strides = model_conv2d_3_Conv2Dx_strides_0, weight = transpose_6_to_fp16, x = model_activation_Selu_cast);
            tensor<fp16, [1, 32, 4096, 131]> model_add_add_cast = add(x = model_conv2d_3_BiasAdd_cast, y = model_conv2d_Selu_cast);
            tensor<string, []> model_conv2d_4_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_4_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_4_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_4_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_4_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_4_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_4_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_4_Conv2Dx_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [4]> model_conv2d_4_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_4_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 1, 7, 7]> transpose_8_to_fp16 = const()[name = tensor<string, []>("transpose_8_to_fp16"), val = tensor<fp16, [32, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12288)))];
            tensor<fp16, [32]> const_41_to_fp16 = const()[name = tensor<string, []>("const_41_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15488)))];
            tensor<fp16, [1, 32, 4096, 131]> model_conv2d_4_BiasAdd_cast = conv(bias = const_41_to_fp16, dilations = model_conv2d_4_Conv2Dx_dilations_0, groups = model_conv2d_4_Conv2Dx_groups_0, pad = model_conv2d_4_Conv2Dx_pad_0, pad_type = model_conv2d_4_Conv2Dx_pad_type_0, strides = model_conv2d_4_Conv2Dx_strides_0, weight = transpose_8_to_fp16, x = model_add_add_cast);
            tensor<string, []> model_conv2d_5_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_5_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_5_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_5_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_5_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_5_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_5_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_5_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_5_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_5_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 32, 1, 1]> transpose_10_to_fp16 = const()[name = tensor<string, []>("transpose_10_to_fp16"), val = tensor<fp16, [64, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15616)))];
            tensor<fp16, [64]> const_42_to_fp16 = const()[name = tensor<string, []>("const_42_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19776)))];
            tensor<fp16, [1, 64, 4096, 131]> model_conv2d_5_BiasAdd_cast = conv(bias = const_42_to_fp16, dilations = model_conv2d_5_Conv2Dx_dilations_0, groups = model_conv2d_5_Conv2Dx_groups_0, pad = model_conv2d_5_Conv2Dx_pad_0, pad_type = model_conv2d_5_Conv2Dx_pad_type_0, strides = model_conv2d_5_Conv2Dx_strides_0, weight = transpose_10_to_fp16, x = model_conv2d_4_BiasAdd_cast);
            tensor<fp16, []> elu_2_alpha_0_to_fp16 = const()[name = tensor<string, []>("elu_2_alpha_0_to_fp16"), val = tensor<fp16, []>(0x1.ac4p+0)];
            tensor<fp16, [1, 64, 4096, 131]> elu_2_cast = elu(alpha = elu_2_alpha_0_to_fp16, x = model_conv2d_5_BiasAdd_cast);
            tensor<fp16, []> model_activation_1_Selu_y_0_to_fp16 = const()[name = tensor<string, []>("model_activation_1_Selu_y_0_to_fp16"), val = tensor<fp16, []>(0x1.0dp+0)];
            tensor<fp16, [1, 64, 4096, 131]> model_activation_1_Selu_cast = mul(x = elu_2_cast, y = model_activation_1_Selu_y_0_to_fp16);
            tensor<string, []> model_conv2d_6_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_6_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_6_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_6_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_6_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_6_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_6_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_6_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_6_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_6_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 64, 1, 1]> transpose_12_to_fp16 = const()[name = tensor<string, []>("transpose_12_to_fp16"), val = tensor<fp16, [32, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19968)))];
            tensor<fp16, [32]> const_43_to_fp16 = const()[name = tensor<string, []>("const_43_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24128)))];
            tensor<fp16, [1, 32, 4096, 131]> model_conv2d_6_BiasAdd_cast = conv(bias = const_43_to_fp16, dilations = model_conv2d_6_Conv2Dx_dilations_0, groups = model_conv2d_6_Conv2Dx_groups_0, pad = model_conv2d_6_Conv2Dx_pad_0, pad_type = model_conv2d_6_Conv2Dx_pad_type_0, strides = model_conv2d_6_Conv2Dx_strides_0, weight = transpose_12_to_fp16, x = model_activation_1_Selu_cast);
            tensor<fp16, [1, 32, 4096, 131]> model_add_1_add_cast = add(x = model_conv2d_6_BiasAdd_cast, y = model_add_add_cast);
            tensor<string, []> model_conv2d_7_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_7_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_7_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_7_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_7_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_7_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_7_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_7_Conv2Dx_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [4]> model_conv2d_7_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_7_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 1, 7, 7]> transpose_14_to_fp16 = const()[name = tensor<string, []>("transpose_14_to_fp16"), val = tensor<fp16, [32, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24256)))];
            tensor<fp16, [32]> const_44_to_fp16 = const()[name = tensor<string, []>("const_44_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27456)))];
            tensor<fp16, [1, 32, 4096, 131]> model_conv2d_7_BiasAdd_cast = conv(bias = const_44_to_fp16, dilations = model_conv2d_7_Conv2Dx_dilations_0, groups = model_conv2d_7_Conv2Dx_groups_0, pad = model_conv2d_7_Conv2Dx_pad_0, pad_type = model_conv2d_7_Conv2Dx_pad_type_0, strides = model_conv2d_7_Conv2Dx_strides_0, weight = transpose_14_to_fp16, x = model_add_1_add_cast);
            tensor<string, []> model_conv2d_8_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_8_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_8_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_8_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_8_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_8_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_8_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_8_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_8_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_8_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 32, 1, 1]> transpose_16_to_fp16 = const()[name = tensor<string, []>("transpose_16_to_fp16"), val = tensor<fp16, [64, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27584)))];
            tensor<fp16, [64]> const_45_to_fp16 = const()[name = tensor<string, []>("const_45_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31744)))];
            tensor<fp16, [1, 64, 4096, 131]> model_conv2d_8_BiasAdd_cast = conv(bias = const_45_to_fp16, dilations = model_conv2d_8_Conv2Dx_dilations_0, groups = model_conv2d_8_Conv2Dx_groups_0, pad = model_conv2d_8_Conv2Dx_pad_0, pad_type = model_conv2d_8_Conv2Dx_pad_type_0, strides = model_conv2d_8_Conv2Dx_strides_0, weight = transpose_16_to_fp16, x = model_conv2d_7_BiasAdd_cast);
            tensor<fp16, []> elu_3_alpha_0_to_fp16 = const()[name = tensor<string, []>("elu_3_alpha_0_to_fp16"), val = tensor<fp16, []>(0x1.ac4p+0)];
            tensor<fp16, [1, 64, 4096, 131]> elu_3_cast = elu(alpha = elu_3_alpha_0_to_fp16, x = model_conv2d_8_BiasAdd_cast);
            tensor<fp16, []> model_activation_2_Selu_y_0_to_fp16 = const()[name = tensor<string, []>("model_activation_2_Selu_y_0_to_fp16"), val = tensor<fp16, []>(0x1.0dp+0)];
            tensor<fp16, [1, 64, 4096, 131]> model_activation_2_Selu_cast = mul(x = elu_3_cast, y = model_activation_2_Selu_y_0_to_fp16);
            tensor<string, []> model_conv2d_9_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_9_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_9_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_9_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_9_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_9_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_9_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_9_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_9_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_9_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 64, 1, 1]> transpose_18_to_fp16 = const()[name = tensor<string, []>("transpose_18_to_fp16"), val = tensor<fp16, [32, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31936)))];
            tensor<fp16, [32]> const_46_to_fp16 = const()[name = tensor<string, []>("const_46_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(36096)))];
            tensor<fp16, [1, 32, 4096, 131]> model_conv2d_9_BiasAdd_cast = conv(bias = const_46_to_fp16, dilations = model_conv2d_9_Conv2Dx_dilations_0, groups = model_conv2d_9_Conv2Dx_groups_0, pad = model_conv2d_9_Conv2Dx_pad_0, pad_type = model_conv2d_9_Conv2Dx_pad_type_0, strides = model_conv2d_9_Conv2Dx_strides_0, weight = transpose_18_to_fp16, x = model_activation_2_Selu_cast);
            tensor<fp16, [1, 32, 4096, 131]> model_add_2_add_cast = add(x = model_conv2d_9_BiasAdd_cast, y = model_add_1_add_cast);
            tensor<int32, [2]> max_pool_0_kernel_sizes_0 = const()[name = tensor<string, []>("max_pool_0_kernel_sizes_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, [2]> max_pool_0_strides_0 = const()[name = tensor<string, []>("max_pool_0_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<string, []> max_pool_0_pad_type_0 = const()[name = tensor<string, []>("max_pool_0_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [4]> max_pool_0_pad_0 = const()[name = tensor<string, []>("max_pool_0_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> max_pool_0_ceil_mode_0 = const()[name = tensor<string, []>("max_pool_0_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 32, 4096, 65]> max_pool_0_cast = max_pool(ceil_mode = max_pool_0_ceil_mode_0, kernel_sizes = max_pool_0_kernel_sizes_0, pad = max_pool_0_pad_0, pad_type = max_pool_0_pad_type_0, strides = max_pool_0_strides_0, x = model_add_2_add_cast);
            tensor<string, []> model_conv2d_10_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_10_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_10_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_10_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_10_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_10_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_10_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_10_Conv2Dx_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [4]> model_conv2d_10_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_10_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 1, 7, 7]> transpose_21_to_fp16 = const()[name = tensor<string, []>("transpose_21_to_fp16"), val = tensor<fp16, [32, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(36224)))];
            tensor<fp16, [32]> const_47_to_fp16 = const()[name = tensor<string, []>("const_47_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39424)))];
            tensor<fp16, [1, 32, 4096, 65]> model_conv2d_10_BiasAdd_cast = conv(bias = const_47_to_fp16, dilations = model_conv2d_10_Conv2Dx_dilations_0, groups = model_conv2d_10_Conv2Dx_groups_0, pad = model_conv2d_10_Conv2Dx_pad_0, pad_type = model_conv2d_10_Conv2Dx_pad_type_0, strides = model_conv2d_10_Conv2Dx_strides_0, weight = transpose_21_to_fp16, x = max_pool_0_cast);
            tensor<string, []> model_conv2d_11_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_11_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_11_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_11_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_11_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_11_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_11_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_11_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_11_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_11_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 32, 1, 1]> transpose_23_to_fp16 = const()[name = tensor<string, []>("transpose_23_to_fp16"), val = tensor<fp16, [64, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39552)))];
            tensor<fp16, [64]> const_48_to_fp16 = const()[name = tensor<string, []>("const_48_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43712)))];
            tensor<fp16, [1, 64, 4096, 65]> model_conv2d_11_BiasAdd_cast = conv(bias = const_48_to_fp16, dilations = model_conv2d_11_Conv2Dx_dilations_0, groups = model_conv2d_11_Conv2Dx_groups_0, pad = model_conv2d_11_Conv2Dx_pad_0, pad_type = model_conv2d_11_Conv2Dx_pad_type_0, strides = model_conv2d_11_Conv2Dx_strides_0, weight = transpose_23_to_fp16, x = model_conv2d_10_BiasAdd_cast);
            tensor<fp16, []> elu_4_alpha_0_to_fp16 = const()[name = tensor<string, []>("elu_4_alpha_0_to_fp16"), val = tensor<fp16, []>(0x1.ac4p+0)];
            tensor<fp16, [1, 64, 4096, 65]> elu_4_cast = elu(alpha = elu_4_alpha_0_to_fp16, x = model_conv2d_11_BiasAdd_cast);
            tensor<fp16, []> model_activation_3_Selu_y_0_to_fp16 = const()[name = tensor<string, []>("model_activation_3_Selu_y_0_to_fp16"), val = tensor<fp16, []>(0x1.0dp+0)];
            tensor<fp16, [1, 64, 4096, 65]> model_activation_3_Selu_cast = mul(x = elu_4_cast, y = model_activation_3_Selu_y_0_to_fp16);
            tensor<string, []> model_conv2d_12_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_12_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_12_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_12_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_12_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_12_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_12_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_12_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_12_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_12_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 64, 1, 1]> transpose_25_to_fp16 = const()[name = tensor<string, []>("transpose_25_to_fp16"), val = tensor<fp16, [32, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43904)))];
            tensor<fp16, [32]> const_49_to_fp16 = const()[name = tensor<string, []>("const_49_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48064)))];
            tensor<fp16, [1, 32, 4096, 65]> model_conv2d_12_BiasAdd_cast = conv(bias = const_49_to_fp16, dilations = model_conv2d_12_Conv2Dx_dilations_0, groups = model_conv2d_12_Conv2Dx_groups_0, pad = model_conv2d_12_Conv2Dx_pad_0, pad_type = model_conv2d_12_Conv2Dx_pad_type_0, strides = model_conv2d_12_Conv2Dx_strides_0, weight = transpose_25_to_fp16, x = model_activation_3_Selu_cast);
            tensor<fp16, [1, 32, 4096, 65]> model_add_3_add_cast = add(x = model_conv2d_12_BiasAdd_cast, y = max_pool_0_cast);
            tensor<string, []> model_conv2d_13_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_13_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_13_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_13_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_13_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_13_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_13_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_13_Conv2Dx_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [4]> model_conv2d_13_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_13_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 1, 7, 7]> transpose_27_to_fp16 = const()[name = tensor<string, []>("transpose_27_to_fp16"), val = tensor<fp16, [32, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48192)))];
            tensor<fp16, [32]> const_50_to_fp16 = const()[name = tensor<string, []>("const_50_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51392)))];
            tensor<fp16, [1, 32, 4096, 65]> model_conv2d_13_BiasAdd_cast = conv(bias = const_50_to_fp16, dilations = model_conv2d_13_Conv2Dx_dilations_0, groups = model_conv2d_13_Conv2Dx_groups_0, pad = model_conv2d_13_Conv2Dx_pad_0, pad_type = model_conv2d_13_Conv2Dx_pad_type_0, strides = model_conv2d_13_Conv2Dx_strides_0, weight = transpose_27_to_fp16, x = model_add_3_add_cast);
            tensor<string, []> model_conv2d_14_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_14_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_14_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_14_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_14_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_14_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_14_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_14_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_14_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_14_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 32, 1, 1]> transpose_29_to_fp16 = const()[name = tensor<string, []>("transpose_29_to_fp16"), val = tensor<fp16, [64, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51520)))];
            tensor<fp16, [64]> const_51_to_fp16 = const()[name = tensor<string, []>("const_51_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55680)))];
            tensor<fp16, [1, 64, 4096, 65]> model_conv2d_14_BiasAdd_cast = conv(bias = const_51_to_fp16, dilations = model_conv2d_14_Conv2Dx_dilations_0, groups = model_conv2d_14_Conv2Dx_groups_0, pad = model_conv2d_14_Conv2Dx_pad_0, pad_type = model_conv2d_14_Conv2Dx_pad_type_0, strides = model_conv2d_14_Conv2Dx_strides_0, weight = transpose_29_to_fp16, x = model_conv2d_13_BiasAdd_cast);
            tensor<fp16, []> elu_5_alpha_0_to_fp16 = const()[name = tensor<string, []>("elu_5_alpha_0_to_fp16"), val = tensor<fp16, []>(0x1.ac4p+0)];
            tensor<fp16, [1, 64, 4096, 65]> elu_5_cast = elu(alpha = elu_5_alpha_0_to_fp16, x = model_conv2d_14_BiasAdd_cast);
            tensor<fp16, []> model_activation_4_Selu_y_0_to_fp16 = const()[name = tensor<string, []>("model_activation_4_Selu_y_0_to_fp16"), val = tensor<fp16, []>(0x1.0dp+0)];
            tensor<fp16, [1, 64, 4096, 65]> model_activation_4_Selu_cast = mul(x = elu_5_cast, y = model_activation_4_Selu_y_0_to_fp16);
            tensor<string, []> model_conv2d_15_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_15_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_15_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_15_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_15_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_15_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_15_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_15_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_15_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_15_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 64, 1, 1]> transpose_31_to_fp16 = const()[name = tensor<string, []>("transpose_31_to_fp16"), val = tensor<fp16, [32, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55872)))];
            tensor<fp16, [32]> const_52_to_fp16 = const()[name = tensor<string, []>("const_52_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60032)))];
            tensor<fp16, [1, 32, 4096, 65]> model_conv2d_15_BiasAdd_cast = conv(bias = const_52_to_fp16, dilations = model_conv2d_15_Conv2Dx_dilations_0, groups = model_conv2d_15_Conv2Dx_groups_0, pad = model_conv2d_15_Conv2Dx_pad_0, pad_type = model_conv2d_15_Conv2Dx_pad_type_0, strides = model_conv2d_15_Conv2Dx_strides_0, weight = transpose_31_to_fp16, x = model_activation_4_Selu_cast);
            tensor<fp16, [1, 32, 4096, 65]> model_add_4_add_cast = add(x = model_conv2d_15_BiasAdd_cast, y = model_add_3_add_cast);
            tensor<string, []> model_conv2d_16_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_16_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_16_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_16_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_16_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_16_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_16_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_16_Conv2Dx_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [4]> model_conv2d_16_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_16_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 1, 7, 7]> transpose_33_to_fp16 = const()[name = tensor<string, []>("transpose_33_to_fp16"), val = tensor<fp16, [32, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60160)))];
            tensor<fp16, [32]> const_53_to_fp16 = const()[name = tensor<string, []>("const_53_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63360)))];
            tensor<fp16, [1, 32, 4096, 65]> model_conv2d_16_BiasAdd_cast = conv(bias = const_53_to_fp16, dilations = model_conv2d_16_Conv2Dx_dilations_0, groups = model_conv2d_16_Conv2Dx_groups_0, pad = model_conv2d_16_Conv2Dx_pad_0, pad_type = model_conv2d_16_Conv2Dx_pad_type_0, strides = model_conv2d_16_Conv2Dx_strides_0, weight = transpose_33_to_fp16, x = model_add_4_add_cast);
            tensor<string, []> model_conv2d_17_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_17_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_17_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_17_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_17_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_17_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_17_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_17_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_17_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_17_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 32, 1, 1]> transpose_35_to_fp16 = const()[name = tensor<string, []>("transpose_35_to_fp16"), val = tensor<fp16, [64, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63488)))];
            tensor<fp16, [64]> const_54_to_fp16 = const()[name = tensor<string, []>("const_54_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(67648)))];
            tensor<fp16, [1, 64, 4096, 65]> model_conv2d_17_BiasAdd_cast = conv(bias = const_54_to_fp16, dilations = model_conv2d_17_Conv2Dx_dilations_0, groups = model_conv2d_17_Conv2Dx_groups_0, pad = model_conv2d_17_Conv2Dx_pad_0, pad_type = model_conv2d_17_Conv2Dx_pad_type_0, strides = model_conv2d_17_Conv2Dx_strides_0, weight = transpose_35_to_fp16, x = model_conv2d_16_BiasAdd_cast);
            tensor<fp16, []> elu_6_alpha_0_to_fp16 = const()[name = tensor<string, []>("elu_6_alpha_0_to_fp16"), val = tensor<fp16, []>(0x1.ac4p+0)];
            tensor<fp16, [1, 64, 4096, 65]> elu_6_cast = elu(alpha = elu_6_alpha_0_to_fp16, x = model_conv2d_17_BiasAdd_cast);
            tensor<fp16, []> model_activation_5_Selu_y_0_to_fp16 = const()[name = tensor<string, []>("model_activation_5_Selu_y_0_to_fp16"), val = tensor<fp16, []>(0x1.0dp+0)];
            tensor<fp16, [1, 64, 4096, 65]> model_activation_5_Selu_cast = mul(x = elu_6_cast, y = model_activation_5_Selu_y_0_to_fp16);
            tensor<string, []> model_conv2d_18_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_18_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_18_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_18_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_18_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_18_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_18_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_18_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_18_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_18_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 64, 1, 1]> transpose_37_to_fp16 = const()[name = tensor<string, []>("transpose_37_to_fp16"), val = tensor<fp16, [32, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(67840)))];
            tensor<fp16, [32]> const_55_to_fp16 = const()[name = tensor<string, []>("const_55_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(72000)))];
            tensor<fp16, [1, 32, 4096, 65]> model_conv2d_18_BiasAdd_cast = conv(bias = const_55_to_fp16, dilations = model_conv2d_18_Conv2Dx_dilations_0, groups = model_conv2d_18_Conv2Dx_groups_0, pad = model_conv2d_18_Conv2Dx_pad_0, pad_type = model_conv2d_18_Conv2Dx_pad_type_0, strides = model_conv2d_18_Conv2Dx_strides_0, weight = transpose_37_to_fp16, x = model_activation_5_Selu_cast);
            tensor<fp16, [1, 32, 4096, 65]> model_add_5_add_cast = add(x = model_conv2d_18_BiasAdd_cast, y = model_add_4_add_cast);
            tensor<int32, [2]> max_pool_1_kernel_sizes_0 = const()[name = tensor<string, []>("max_pool_1_kernel_sizes_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, [2]> max_pool_1_strides_0 = const()[name = tensor<string, []>("max_pool_1_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<string, []> max_pool_1_pad_type_0 = const()[name = tensor<string, []>("max_pool_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [4]> max_pool_1_pad_0 = const()[name = tensor<string, []>("max_pool_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> max_pool_1_ceil_mode_0 = const()[name = tensor<string, []>("max_pool_1_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 32, 4096, 32]> max_pool_1_cast = max_pool(ceil_mode = max_pool_1_ceil_mode_0, kernel_sizes = max_pool_1_kernel_sizes_0, pad = max_pool_1_pad_0, pad_type = max_pool_1_pad_type_0, strides = max_pool_1_strides_0, x = model_add_5_add_cast);
            tensor<string, []> model_conv2d_19_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_19_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_19_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_19_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_19_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_19_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_19_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_19_Conv2Dx_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [4]> model_conv2d_19_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_19_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 1, 7, 7]> transpose_40_to_fp16 = const()[name = tensor<string, []>("transpose_40_to_fp16"), val = tensor<fp16, [32, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(72128)))];
            tensor<fp16, [32]> const_56_to_fp16 = const()[name = tensor<string, []>("const_56_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(75328)))];
            tensor<fp16, [1, 32, 4096, 32]> model_conv2d_19_BiasAdd_cast = conv(bias = const_56_to_fp16, dilations = model_conv2d_19_Conv2Dx_dilations_0, groups = model_conv2d_19_Conv2Dx_groups_0, pad = model_conv2d_19_Conv2Dx_pad_0, pad_type = model_conv2d_19_Conv2Dx_pad_type_0, strides = model_conv2d_19_Conv2Dx_strides_0, weight = transpose_40_to_fp16, x = max_pool_1_cast);
            tensor<string, []> model_conv2d_20_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_20_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_20_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_20_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_20_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_20_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_20_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_20_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_20_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_20_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 32, 1, 1]> transpose_42_to_fp16 = const()[name = tensor<string, []>("transpose_42_to_fp16"), val = tensor<fp16, [64, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(75456)))];
            tensor<fp16, [64]> const_57_to_fp16 = const()[name = tensor<string, []>("const_57_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79616)))];
            tensor<fp16, [1, 64, 4096, 32]> model_conv2d_20_BiasAdd_cast = conv(bias = const_57_to_fp16, dilations = model_conv2d_20_Conv2Dx_dilations_0, groups = model_conv2d_20_Conv2Dx_groups_0, pad = model_conv2d_20_Conv2Dx_pad_0, pad_type = model_conv2d_20_Conv2Dx_pad_type_0, strides = model_conv2d_20_Conv2Dx_strides_0, weight = transpose_42_to_fp16, x = model_conv2d_19_BiasAdd_cast);
            tensor<fp16, []> elu_7_alpha_0_to_fp16 = const()[name = tensor<string, []>("elu_7_alpha_0_to_fp16"), val = tensor<fp16, []>(0x1.ac4p+0)];
            tensor<fp16, [1, 64, 4096, 32]> elu_7_cast = elu(alpha = elu_7_alpha_0_to_fp16, x = model_conv2d_20_BiasAdd_cast);
            tensor<fp16, []> model_activation_6_Selu_y_0_to_fp16 = const()[name = tensor<string, []>("model_activation_6_Selu_y_0_to_fp16"), val = tensor<fp16, []>(0x1.0dp+0)];
            tensor<fp16, [1, 64, 4096, 32]> model_activation_6_Selu_cast = mul(x = elu_7_cast, y = model_activation_6_Selu_y_0_to_fp16);
            tensor<string, []> model_conv2d_21_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_21_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_21_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_21_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_21_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_21_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_21_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_21_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_21_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_21_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 64, 1, 1]> transpose_44_to_fp16 = const()[name = tensor<string, []>("transpose_44_to_fp16"), val = tensor<fp16, [32, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79808)))];
            tensor<fp16, [32]> const_58_to_fp16 = const()[name = tensor<string, []>("const_58_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(83968)))];
            tensor<fp16, [1, 32, 4096, 32]> model_conv2d_21_BiasAdd_cast = conv(bias = const_58_to_fp16, dilations = model_conv2d_21_Conv2Dx_dilations_0, groups = model_conv2d_21_Conv2Dx_groups_0, pad = model_conv2d_21_Conv2Dx_pad_0, pad_type = model_conv2d_21_Conv2Dx_pad_type_0, strides = model_conv2d_21_Conv2Dx_strides_0, weight = transpose_44_to_fp16, x = model_activation_6_Selu_cast);
            tensor<fp16, [1, 32, 4096, 32]> model_add_6_add_cast = add(x = model_conv2d_21_BiasAdd_cast, y = max_pool_1_cast);
            tensor<string, []> model_conv2d_22_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_22_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_22_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_22_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_22_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_22_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_22_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_22_Conv2Dx_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [4]> model_conv2d_22_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_22_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 1, 7, 7]> transpose_46_to_fp16 = const()[name = tensor<string, []>("transpose_46_to_fp16"), val = tensor<fp16, [32, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(84096)))];
            tensor<fp16, [32]> const_59_to_fp16 = const()[name = tensor<string, []>("const_59_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87296)))];
            tensor<fp16, [1, 32, 4096, 32]> model_conv2d_22_BiasAdd_cast = conv(bias = const_59_to_fp16, dilations = model_conv2d_22_Conv2Dx_dilations_0, groups = model_conv2d_22_Conv2Dx_groups_0, pad = model_conv2d_22_Conv2Dx_pad_0, pad_type = model_conv2d_22_Conv2Dx_pad_type_0, strides = model_conv2d_22_Conv2Dx_strides_0, weight = transpose_46_to_fp16, x = model_add_6_add_cast);
            tensor<string, []> model_conv2d_23_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_23_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_23_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_23_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
